xuewenxin1/SKD26502_SMART_GREENHOUSE/03.software/02.source_code/03.controller_unit_sensor/system/libs/fwlib/py32l090_hal_lpuart.h
/** @brief  Clear the specified LPUART ISR flag, in setting the proper ICR register flag.
  * @param  __HANDLE__ specifies the LPUART Handle.
  * @param  __IT_CLEAR__ specifies the interrupt clear register flag that needs to be set
  *                       to clear the corresponding interrupt
  *          This parameter can be one of the following values:
  *            @arg @ref LPUART_CLEAR_PEF    Parity Error Clear Flag
  *            @arg @ref LPUART_CLEAR_FEF    Framing Error Clear Flag
  *            @arg @ref LPUART_CLEAR_NEF    Noise detected Clear Flag
  *            @arg @ref LPUART_CLEAR_OREF   Overrun Error Clear Flag
  *            @arg @ref LPUART_CLEAR_IDLEF  IDLE line detected Clear Flag
  *            @arg @ref LPUART_CLEAR_TCF    Transmission Complete Clear Flag
  *            @arg @ref LPUART_CLEAR_CTSF   CTS Interrupt Clear Flag
  *            @arg @ref LPUART_CLEAR_CMF    Character Match Clear Flag
  *            @arg @ref LPUART_CLEAR_WUF    Wake Up from stop mode Clear Flag
  * @retval None
  */
#define __HAL_LPUART_CLEAR_IT(__HANDLE__, __IT_CLEAR__) ((__HANDLE__)->Instance->ICR = (uint32_t)(__IT_CLEAR__))

/** @brief  Set a specific LPUART request flag.
  * @param  __HANDLE__ specifies the LPUART Handle.
  * @param  __REQ__ specifies the request flag to set
  *          This parameter can be one of the following values:
  *            @arg @ref LPUART_SENDBREAK_REQUEST Send Break Request
  *            @arg @ref LPUART_MUTE_MODE_REQUEST Mute Mode Request
  * @retval None
  */
#define __HAL_LPUART_SEND_REQ(__HANDLE__, __REQ__) ((__HANDLE__)->Instance->RQR |= (uint16_t)(__REQ__))

/** @brief  Enable LPUART.
  * @param  __HANDLE__ specifies the LPUART Handle.
  * @retval None
  */
#define __HAL_LPUART_ENABLE(__HANDLE__)                   ((__HANDLE__)->Instance->CR1 |= LPUART_CR1_UE)

/** @brief  Disable LPUART.
  * @param  __HANDLE__ specifies the LPUART Handle.
  * @retval None
  */
#define __HAL_LPUART_DISABLE(__HANDLE__)                  ((__HANDLE__)->Instance->CR1 &= ~LPUART_CR1_UE)

/** @brief  Enable CTS flow control.
  * @note   This macro allows to enable CTS hardware flow control for a given LPUART instance,
  *         without need to call HAL_LPUART_Init() function.
  *         As involving direct access to LPUART registers, usage of this macro should be fully endorsed by user.
  * @note   As macro is expected to be used for modifying CTS Hw flow control feature activation, without need
  *         for LPUART instance Deinit/Init, following conditions for macro call should be fulfilled :
  *           - LPUART instance should have already been initialised (through call of HAL_LPUART_Init() )
  *           - macro could only be called when corresponding LPUART instance is disabled
  *             (i.e. __HAL_LPUART_DISABLE(__HANDLE__)) and should be followed by an Enable
  *              macro (i.e. __HAL_LPUART_ENABLE(__HANDLE__)).
  * @param  __HANDLE__ specifies the LPUART Handle.
  * @retval None
  */
#define __HAL_LPUART_HWCONTROL_CTS_ENABLE(__HANDLE__)        \
  do{                                                       \
    SET_BIT((__HANDLE__)->Instance->CR3, LPUART_CR3_CTSE);  \
    (__HANDLE__)->Init.HwFlowCtl |= LPUART_CR3_CTSE;        \
  } while(0U)

/** @brief  Disable CTS flow control.
  * @note   This macro allows to disable CTS hardware flow control for a given LPUART instance,
  *         without need to call HAL_LPUART_Init() function.
  *         As involving direct access to LPUART registers, usage of this macro should be fully endorsed by user.
  * @note   As macro is expected to be used for modifying CTS Hw flow control feature activation, without need
  *         for LPUART instance Deinit/Init, following conditions for macro call should be fulfilled :
  *           - LPUART instance should have already been initialised (through call of HAL_LPUART_Init() )
  *           - macro could only be called when corresponding LPUART instance is disabled
  *             (i.e. __HAL_LPUART_DISABLE(__HANDLE__)) and should be followed by an Enable
  *              macro (i.e. __HAL_LPUART_ENABLE(__HANDLE__)).
  * @param  __HANDLE__ specifies the LPUART Handle.
  * @retval None
  */
#define __HAL_LPUART_HWCONTROL_CTS_DISABLE(__HANDLE__)        \
  do{                                                       \
    CLEAR_BIT((__HANDLE__)->Instance->CR3, LPUART_CR3_CTSE); \
    (__HANDLE__)->Init.HwFlowCtl &= ~(LPUART_CR3_CTSE);      \
  } while(0U)

/** @brief  Enable RTS flow control.
  * @note   This macro allows to enable RTS hardware flow control for a given LPUART instance,
  *         without need to call HAL_LPUART_Init() function.
  *         As involving direct access to LPUART registers, usage of this macro should be fully endorsed by user.
  * @note   As macro is expected to be used for modifying RTS Hw flow control feature activation, without need
  *         for LPUART instance Deinit/Init, following conditions for macro call should be fulfilled :
  *           - LPUART instance should have already been initialised (through call of HAL_LPUART_Init() )
  *           - macro could only be called when corresponding LPUART instance is disabled
  *             (i.e. __HAL_LPUART_DISABLE(__HANDLE__)) and should be followed by an Enable
  *              macro (i.e. __HAL_LPUART_ENABLE(__HANDLE__)).
  * @param  __HANDLE__ specifies the LPUART Handle.
  * @retval None
  */
#define __HAL_LPUART_HWCONTROL_RTS_ENABLE(__HANDLE__)       \
  do{                                                     \
    SET_BIT((__HANDLE__)->Instance->CR3, LPUART_CR3_RTSE); \
    (__HANDLE__)->Init.HwFlowCtl |= LPUART_CR3_RTSE;       \
  } while(0U)

/** @brief  Disable RTS flow control.
  * @note   This macro allows to disable RTS hardware flow control for a given LPUART instance,
  *         without need to call HAL_LPUART_Init() function.
  *         As involving direct access to LPUART registers, usage of this macro should be fully endorsed by user.
  * @note   As macro is expected to be used for modifying RTS Hw flow control feature activation, without need
  *         for LPUART instance Deinit/Init, following conditions for macro call should be fulfilled :
  *           - LPUART instance should have already been initialised (through call of HAL_LPUART_Init() )
  *           - macro could only be called when corresponding LPUART instance is disabled
  *             (i.e. __HAL_LPUART_DISABLE(__HANDLE__)) and should be followed by an Enable
  *              macro (i.e. __HAL_LPUART_ENABLE(__HANDLE__)).
  * @param  __HANDLE__ specifies the LPUART Handle.
  * @retval None
  */
#define __HAL_LPUART_HWCONTROL_RTS_DISABLE(__HANDLE__)       \
  do{                                                      \
    CLEAR_BIT((__HANDLE__)->Instance->CR3, LPUART_CR3_RTSE);\
    (__HANDLE__)->Init.HwFlowCtl &= ~(LPUART_CR3_RTSE);     \
  } while(0U)
/**
  * @}
  */

